In [10]:
import pandas as pd

data = pd.DataFrame({
    'name': ['John', 'Anna', 'Peter', 'Linda'],
    'age': [23, 36, 32, 28],
    'city': ['New York', 'Paris', 'Berlin', 'London'],
    'job': ['student', 'teacher', 'developer', 'nurse']
})

data

    name  age      city        job
0   John   23  New York    student
1   Anna   36     Paris    teacher
2  Peter   32    Berlin  developer
3  Linda   28    London      nurse

In [ ]:
import pandas as pd

pd.merge(left, right, how='inner', on=None, left_on=None, right_on=None, left_index=False, right_index=False, sort=False)

# left Object DataFrame
# right Object DataFrame yang lain
# on Kolom yg akan digabung. Harus ditemukan di objek DataFrame kiri dan kanan. 
# how Diisi dengan salah satu dari : 'left', 'right', 'outer', 'inner'. Defaults : ‘inner’. 
# sort Mengurutkan ‘join keys’ berdasarkan alphabet. Defaults = False

In [ ]:
import pandas as pd

# pandas.DataFrame(data, index, columns, dtype, copy)

data = [['Anton', 23], ['Budi', 25], ['Cici', 22]]
df = pd.DataFrame(data, columns=['Nama', 'Usia'], index=['a', 'b', 'c'])
df

    Nama  Usia
a  Anton    23
b   Budi    25
c   Cici    22

In [ ]:
df['Alamat'] = ['Jakarta', 'Bandung', 'Surabaya']
df

    Nama  Usia    Alamat
a  Anton    23   Jakarta
b   Budi    25   Bandung
c   Cici    22  Surabaya

In [13]:
df.insert(1, 'Menikah', [False, True, False])
df

    Nama  Menikah      Kota  Usia    Alamat
a  Anton    False   Jakarta    23   Jakarta
b   Budi     True   Bandung    25   Bandung
c   Cici    False  Surabaya    22  Surabaya

In [14]:
import pandas as pd

data = {
    'Nama': ['Anton', 'Budi', 'Cici'],
    'Usia': [23, 25, 22]
}
df = pd.DataFrame(data)
alamat = ['Jakarta', 'Bandung', 'Surabaya']
pekerjaan = ['PNS', 'Guru', 'Dokter']
df=df.assign(Address=alamat, Job=pekerjaan)
df

    Nama  Usia   Address     Job
0  Anton    23   Jakarta     PNS
1   Budi    25   Bandung    Guru
2   Cici    22  Surabaya  Dokter

In [15]:
import pandas as pd

data = {
    'Nama': ['Anton', 'Budi', 'Cici'],
    'Usia': [23, 25, 22]
}
df = pd.DataFrame(data)
alamat = ['Jakarta', 'Bandung', 'Surabaya']
pekerjaan = ['PNS', 'Guru', 'Dokter']
df[['Address', 'Job']] = pd.DataFrame({'Address': alamat, 'Job': pekerjaan})
df

    Nama  Usia   Address     Job
0  Anton    23   Jakarta     PNS
1   Budi    25   Bandung    Guru
2   Cici    22  Surabaya  Dokter

In [25]:
import pandas as pd
data = {
    'Nama': ['Anton', 'Budi', 'Cici'],
    'Usia': [23, 25, 22],
    'Address': ['Jakarta', 'Bandung', 'Surabaya'],
    'Job': ['PNS', 'Guru', 'Dokter']
}
df = pd.DataFrame(data)
del df['Usia']
df

    Nama   Address     Job
0  Anton   Jakarta     PNS
1   Budi   Bandung    Guru
2   Cici  Surabaya  Dokter

In [39]:
import pandas as pd   
data = {
    'Nama': ['Anton', 'Budi', 'Cici', 'Doni', 'Euis', 'Faza'],
    'Usia': [22, 25, 22, 24, 27, 21],
    'Address': ['Jakarta', 'Bandung', 'Surabaya', 'Jakarta', 'Bandung', 'Surabaya'],
    'Job': ['PNS', 'Guru', 'Dokter', 'PNS', 'Guru', 'Dokter']
}
df = pd.DataFrame(data, index=[1, 2, 3, 4, 5, 6])
df.sort_values(by=['Usia', 'Nama'], ascending=False)

    Nama  Usia   Address     Job
5   Euis    27   Bandung    Guru
2   Budi    25   Bandung    Guru
4   Doni    24   Jakarta     PNS
3   Cici    22  Surabaya  Dokter
1  Anton    22   Jakarta     PNS
6   Faza    21  Surabaya  Dokter

In [55]:
import pandas as pd

data = {
    'Nama': ['Anton', 'Budi', 'Cici', 'Doni', 'Euis', 'Faza'],
    'Usia': [22, 25, 22, 24, 27, 21],
    'Address': ['Jakarta', 'Bandung', 'Surabaya', 'Jakarta', 'Bandung', 'Surabaya'],
    'Job': ['PNS', 'Guru', 'Dokter', 'PNS', 'Guru', 'Dokter']
}

df = pd.DataFrame(data, index=[1, 2, 3, 4, 5, 6])
df[df.Job.str.contains('PN')]

    Nama  Usia  Address  Job
1  Anton    22  Jakarta  PNS
4   Doni    24  Jakarta  PNS

In [67]:
import pandas as pd  
data = {
    'Nama': ['Anton', 'Budi', 'Cici', 'Doni', 'Euis', 'Faza'],
    'Usia': [22, 25, 22, 24, 27, 21],
    'Address': ['Jakarta', 'Bandung', 'Surabaya', 'Jakarta', 'Bandung', 'Surabaya'],
    'Job': ['PNS', 'Guru', 'Dokter', 'PNS', 'Guru', 'Dokter'],
    'Salary': [200, 300, 400, 500, 600, 700]
}
df = pd.DataFrame(data, index=[1, 2, 3, 4, 5, 6])
groups = df.groupby('Job')
for job, group in groups:
    print(job)
    print(group)

Dokter
   Nama  Usia   Address     Job  Salary
3  Cici    22  Surabaya  Dokter     400
6  Faza    21  Surabaya  Dokter     700
Guru
   Nama  Usia  Address   Job  Salary
2  Budi    25  Bandung  Guru     300
5  Euis    27  Bandung  Guru     600
PNS
    Nama  Usia  Address  Job  Salary
1  Anton    22  Jakarta  PNS     200
4   Doni    24  Jakarta  PNS     500

In [68]:
import pandas as pd
kiri = pd.DataFrame({
    'Id': [1,2,3],
    'Nama': ['Anton', 'Budi', 'Cici'],
    'Alamat': ['Jakarta', 'Bandung', 'Surabaya']
})
kanan = pd.DataFrame({
    'Id': [2,3,1],
    'Nama': ['Doni', 'Euis', 'Fafa'],
    'Alamat': ['Bogor', 'Garut', 'Cirebon']
})
gabung = pd.merge(kiri, kanan, on='Id')
gabung

   Id Nama_x  Alamat_x Nama_y Alamat_y
0   1  Anton   Jakarta   Fafa  Cirebon
1   2   Budi   Bandung   Doni    Bogor
2   3   Cici  Surabaya   Euis    Garut

In [85]:
import pandas as pd   
karyawan = pd.DataFrame({
    'Nama': ['Anton', 'Budi', 'Cici', 'Doni', 'Euis', 'Faza'],
    'Alamat': ['Jakarta', 'Bandung', 'Surabaya', 'Jakarta', 'Bandung', 'Surabaya'],
    'Id Pekerjaan': [10, 2, 3, 1, 2, 4]
})
perkerjaan = pd.DataFrame({
    'Id': [1,2,3,4],
    'Nama': ['Frontend Developer', 'Data Engineer', 'Backend Developer', 'Project Manager'],
    'Gaji': [200, 300, 400, 500]
})
gabung = pd.merge(karyawan, perkerjaan, left_on='Id Pekerjaan', right_on='Id', how='outer')
gabung = gabung.drop(['Id Pekerjaan', 'Id'], axis=1)
gabung = gabung.rename(columns={'Nama_x': 'Nama Karyawan', 'Nama_y': 'Nama Pekerjaan'})
gabung

  Nama Karyawan    Alamat      Nama Pekerjaan   Gaji
0          Doni   Jakarta  Frontend Developer  200.0
1          Budi   Bandung       Data Engineer  300.0
2          Euis   Bandung       Data Engineer  300.0
3          Cici  Surabaya   Backend Developer  400.0
4          Faza  Surabaya     Project Manager  500.0
5         Anton   Jakarta                 NaN    NaN

In [91]:
import pandas as pd
karyawan = pd.DataFrame({
    'Nama': ['Anton', 'Budi', 'Cici', 'Doni', 'Euis', 'Faza'],
    'Alamat': ['Jakarta', 'Bandung', 'Surabaya', 'Jakarta', 'Bandung', 'Surabaya'],
    'Id Pekerjaan': [1, 2, 3, 1, 2, 4],
    'Id Level': [1, 2, 3, 1, 2, 3]
})
pekerjaan = pd.DataFrame({
    'Id Pekerjaan': [1, 2, 3, 4],
    'Nama Pekerjaan': ['Frontend Developer', 'Data Engineer', 'Backend Developer', 'Project Manager'],
    'Gaji': [200, 300, 400, 500]
})
level = pd.DataFrame({
    'Id Level': [1, 2, 3],
    'Nama Level': ['Junior', 'Intermediate', 'Senior']
})
df = pd.merge(pd.merge(karyawan, pekerjaan, on='Id Pekerjaan', how='left'), level, on='Id Level', how='left')
df = df.drop(['Id Pekerjaan', 'Id Level'], axis=1)
df

    Nama    Alamat      Nama Pekerjaan  Gaji    Nama Level
0  Anton   Jakarta  Frontend Developer   200        Junior
1   Budi   Bandung       Data Engineer   300  Intermediate
2   Cici  Surabaya   Backend Developer   400        Senior
3   Doni   Jakarta  Frontend Developer   200        Junior
4   Euis   Bandung       Data Engineer   300  Intermediate
5   Faza  Surabaya     Project Manager   500        Senior